Soap/operation/CARD_PAYMENT/CARD_PAYMENT_Samples/import_CARD_PAYMENT_Full.xml

<?xml version="1.0" encoding="UTF-8" ?>
<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
    <soap:Body>
        <AMLYZE_OPERATION xmlns="urn:amlyze-services:EvaluateOperationService_v2r0">
            <CommunicationNumber>ComNr_0073</CommunicationNumber>
            <Requester>financial_institution</Requester>
            <OperationExtId>Op_0073</OperationExtId>
            <OperationType>CARD_PAYMENT</OperationType>
            <CardOperationSubType>CARD_PAYMENT_CREDIT</CardOperationSubType>
            <RiskManagementCategory>OP_DEFAULT</RiskManagementCategory>
            <SourceOfRiskLevel>IMPORT</SourceOfRiskLevel>
            <OperationStatus>EXECUTED</OperationStatus>
            <RiskLevel>HIGH</RiskLevel>
            <InitializeScreeningProcesses>
                <Process>SANCTIONS</Process>
                <Process>ADVERSE_MEDIA</Process>
                <Process>PEP</Process>
            </InitializeScreeningProcesses>
            <OperationDateTime>2023-09-23T15:09:33+02:00</OperationDateTime>
            <SourceCountry>LT</SourceCountry>
            <DestinationCountry>LV</DestinationCountry>
            <Currency>EUR</Currency>
            <Amount>200</Amount>
            <EuroExchangeRate>1.00</EuroExchangeRate>
            <AmountInEuro>200</AmountInEuro>
            <FinancialFlowDirection>INCOMING</FinancialFlowDirection>
            <Description>Invoice '445445'</Description>
            <IPAddress>555.222.4545.144</IPAddress>
            <IPAddressCountry>LT</IPAddressCountry>
            <TerminalExtId>AOZ_AOC541</TerminalExtId>
            <TerminalCode>400154</TerminalCode>
            <MerchantExtId>400155</MerchantExtId>
            <MerchantDescription>Financial Terminal</MerchantDescription>
            <MerchantName>XYZ Bank Group - Terminal 1</MerchantName>
            <MerchantCountryCode>UA</MerchantCountryCode>
            <SalesPointExtId>AOZ_AOC541ZZ41</SalesPointExtId>
            <SalesPointCode>87400154</SalesPointCode>
            <ListOperationParty>
                <OperationParty>
                    <PartyRole>DEBTOR</PartyRole>
                    <AccountNumber>LT5630800200000745112</AccountNumber>
                    <Currency>EUR</Currency>
                    <EntityType>ORGANIZATION</EntityType>
                    <Title>LAMEER</Title>
                    <CardNumber>545754841254</CardNumber>
                    <CardValidTill>2027-12-01</CardValidTill>
                    <CardHolderName>L. Hammeri</CardHolderName>
                </OperationParty>
                <OperationParty>
                    <PartyRole>CREDITOR</PartyRole>
                    <AccountNumber>LT933520036948858623</AccountNumber>
                    <Currency>EUR</Currency>
                    <BIC>BICXX22</BIC>
                    <EntityType>INDIVIDUAL</EntityType>
                    <FirstName>Geli</FirstName>
                    <LastName>Deliono</LastName>
                    <CardNumber>745754841288</CardNumber>
                    <CardValidTill>2025-12-01</CardValidTill>
                    <CardHolderName>Geli Jr. Deliono</CardHolderName>
                </OperationParty>
            </ListOperationParty>
        </AMLYZE_OPERATION>
    </soap:Body>
</soap:Envelope>
